IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_pga_regs.xml
<module id="PGA_REGS" HW_revision="" description="PGA Registers">
	<register id="PGACTL" width="32" page="1" offset="0x0" internal="0" description="PGA Control Register">
		<bitfield id="PGAEN" description="PGA Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTRESSEL" description="Filter Resistor Select" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="GAIN" description="PGA gain setting" begin="7" end="5" width="3" rwaccess="RW"/>
	</register>
	<register id="PGALOCK" width="16" page="1" offset="0x2" internal="0" description="PGA Lock Register">
		<bitfield id="PGACTL" description="Lock bit for PGACTL." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PGAGAIN3TRIM" description="Lock bit for PGAGAIN3TRIM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PGAGAIN6TRIM" description="Lock bit for PGAGAIN6TRIM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PGAGAIN12TRIM" description="Lock bit for PGAGAIN12TRIM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PGAGAIN24TRIM" description="Lock bit for PGAGAIN24TRIM." begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PGAGAIN3TRIM" width="16" page="1" offset="0x4" internal="0" description="PGA Gain Trim Register for a gain setting of 3">
		<bitfield id="GAINTRIM" description="Gain TRIM value, when gain setting is 3" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFSETTRIM" description="OFFSET TRIM value, when Gain setting is 3" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="PGAGAIN6TRIM" width="16" page="1" offset="0x5" internal="0" description="PGA Gain Trim Register for a gain setting of 6">
		<bitfield id="GAINTRIM" description="Gain TRIM value, when gain setting is 6" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFSETTRIM" description="OFFSET TRIM value, when Gain setting is 6" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="PGAGAIN12TRIM" width="16" page="1" offset="0x6" internal="0" description="PGA Gain Trim Register for a gain setting of 12">
		<bitfield id="GAINTRIM" description="Gain TRIM value, when gain setting is 12" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFSETTRIM" description="OFFSET TRIM value, when Gain setting is 12" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="PGAGAIN24TRIM" width="16" page="1" offset="0x7" internal="0" description="PGA Gain Trim Register for a gain setting of 24">
		<bitfield id="GAINTRIM" description="Gain TRIM value, when gain setting is 24" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFSETTRIM" description="OFFSET TRIM value, when Gain setting is 24" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="PGATYPE" width="16" page="1" offset="0x8" internal="0" description="PGA Type Register">
		<bitfield id="REV" description="PGA Revision Field" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="TYPE" description="PGA Type Field" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
</module>
